import type { InlineQueryResult } from "telegraf/types"

const foresightResults = [
 "Завтра ти прокинешся з відчуттям, що щось не так. І це не відчуття.",
 "Всесвіт почув твоє «а що ще може статись?» і відкрив нотатник.",
 "Твій життєвий план оновлено. Версія 6.6.6 — баги не пофіксили.",
 "Ти станеш сильнішою. Бо інших опцій у меню немає.",
 "Скоро ти отримаєш урок. Без теорії. Одразу контрольна.",
 "Карма не мстива. Вона просто з хорошою пам’яттю.",
  "Твоя інтуїція кричала. Ти зробила вигляд, що це вітер.",
  "У найближчі дні ти скажеш «та норм». І це буде найбільша брехня тижня.",
  "Все складеться. Питання — куди саме.",
  "Твоя зона комфорту офіційно оголошена в розшук.",
  "Скоро життя натисне «продовжити без збереження».",
  "Ти переживеш це. Але меми про це будуть темні.",
  "Оптимізм повернеться. Після тривалого лікарняного.",
  "Всесвіт готує поворот. Різкий. Без попереджувальних знаків.",
  "Ти отримаєш відповідь. Вона тобі не сподобається.",
  "Плани є. Реальність теж має плани. І вони агресивніші.",
  "Твій внутрішній дорослий вийде на зміну. І одразу звільниться.",
  "Скоро ти зрозумієш, що це був ще легкий рівень.",
  "Життя не тестує тебе. Воно проводить стрес-тест.",
  "Все буде добре. Але спочатку — повний аудит твоєї витривалості."
]

export const getRandomForesight = (name: string):InlineQueryResult => {
    const randomIndex = Math.floor(Math.random() * foresightResults.length)
    return {
         type: 'article',
    id: '1',
    title: 'Начаклую....🔮',
    description: 'Дізнайся своє передбачення!',
    input_message_content: {
      message_text: `🔮 Передбачення для ${name}:\n\n${foresightResults[randomIndex]}`
    }
    }
    
}